{"text": "After you have run several experiments, you can check out the Browser to view all of your results, sorted for each device that you have tested. When you first open the Browser, you will see a list of Projects for your user. If you do not see the projects that to expect to see, make sure you have the correct User selected from the dropdown in the top-right corner of the application bar. Once you have your User selected, you can explore all of your files within the Browser. On each page you can use the search bar at the top to search for specific results, and you can use the options at the bottom to show or hide more rows in the table. \n\nIf you are having trouble finding what you are looking for, remember that the Dashboard contains the Recent Activity feed that lists all of the newest devices, so this might be helpful if it has been a while since you last used the system.\n\nWhen you reach a particular device of interest, you will see a list of every experiment that has even been run on that device in order. Large experiments that saved multiple data files will reflect this in the \"indexes\" column in this view. At the bottom of the \"device\" and \"chip\" pages there is a toggle switch for showing summary plots that provide some information about the device.\n\nIf you select a particular experiment in the Browser, you will see a grid of all of the plots that are available to show for this experiment. If no plots are shown, then the experiment may have been aborted early without saving any data. You can export the data to view it directly in a CSV file using the download button in the top right corner of this view. Below the plots is the Notes editor that allows users to add notes for themselves about the experiments, which will be saved to a permanent text file alongside the data. Below to the Notes editor is the Data Export toolbar with information on where the data is stored on this computer and options to export the data in CSV format. Below the Data Export toolbar is a list of parameters that were used to run the experiment, which can be useful as a reference. ", "title": "Browser", "edit_mode": false, "readonly": true}
