{"title": "Data Saving: Workspaces and Identifiers", "text": "One of the most important features of the User Interface is its ability to manage and track your data. However, in order to do this, the software needs to be given a folder where it can save data on your computer, and this is called your Workspace folder. If at any time you would like to start fresh, simply create a new folder on your computer and tell the software that this is its new Workspace (the workspace can be changed in the top right of the menu bar). The old data will remain safely intact, and you can switch your Workspace back to view the old data at any time.\n\nIf you peek inside an active Workspace folder, you will see a list of folders with names that match the \"users\" of that Workspace. Inside each user folder, you will see all of the \"project\" folders associated with that user. Projects then contain wafer folders, which contain chip folders, which contain device folders, which contain experiment folders, which (finally) contain actual data files. These \"user\" / \"project\" / \"wafer\" / \"chip\" / \"device\" details are known collectively as the Identifiers of the experiment because they provide a unique ID that can always allow that data to be distinguished from other experiments. The Identifiers are set when the experiment is setup within the Experiment Runner (or within the Schedule Builder for custom experiments). If the user does not need to use an Identifier (perhaps your devices are not built on silicon wafers) it can simply be left blank and the software will fill it in with a generic placeholder. \n\nUnderstanding that this software just saves files within a Workspace folder, and this folder contains a series of sub-folders for organization purposes hopefully helps to demystify the data organization process. In fact, creating a new User named \"John\" is as simple as opening your Workspace and creating a new folder named \"John\". However, John will not have any data available to view until you actually run an experiment which specifies John as the user."}
